app/controllers/apply_controller.rb

  def email
    # just use the person's email address and send the job to them
    @email = params[:email]
    @job = JobPosting.find(params[:id])
---
SELECT * FROM `job_postings` WHERE (`job_postings`.`id` = 1)