app/controllers/buy_credits_controller.rb

  def checkout
    # make sure the n is something real (not 0, 1.2, etc)
    n = params[:n]
    amt = ((n.to_i) *99 ) * 100 # cents!
    invoice = Invoice.new(:status=>"pending", :product=>n, :amount=>amt, :user_id=>@user.id)
    begin
      invoice.save!
---
INSERT INTO `invoices` (`billed_date`, `status`, `updated_at`, `product`, `amount`, `user_id`, `created_at`) VALUES(NULL, 'pending', '2010-08-12 17:20:59', '2', 198000, 1, '2010-08-12 17:20:59')

  def confirm
    redirect_to :action => 'index' unless params[:token]

    details_response = gateway.details_for(params[:token])
    # logger.debug(details_response.inspect)

    if !details_response.success?
      @message = details_response.message
      render :action => 'error'
      return
    end
    @address = details_response.address

    begin
      @invoice = Invoice.find(session[:i])
---
SELECT * FROM `invoices` WHERE (`invoices`.`id` = 1)

  def complete
    begin
      @invoice = Invoice.find(session[:i])
    rescue ActiveRecord::RecordNotFound
      @message = "The invoice for this transaction could not be found."
      render :action => 'error'
    end

    purchase = gateway.purchase(@invoice.amount,
    :ip => request.remote_ip,
    :payer_id => params[:payer_id],
    :token => params[:token]
    )

    if !purchase.success?
      @message  = purchase.message
      render :action => 'error'
      return
    end

    # otherwise the purchase was a success so
    # update the invoice
    # update the user obj
    # send them an email
    @invoice.status = "paid"
    @invoice.billed_date = Time.now
    @invoice.updated_at = Time.now
    @invoice.save
    @user.credits += @invoice.product
    @user.save
---
SELECT * FROM `invoices` WHERE (`invoices`.`id` = 1)
UPDATE `invoices` SET `updated_at` = '2010-09-16 22:31:02', `billed_date` = '2010-09-16 22:31:02', `status` = 'paid' WHERE `id` = 20
UPDATE `users` SET `updated_at` = '2010-09-16 22:30:57', `activated_at` = '2010-09-16 22:30:57' WHERE `id` = 1

  def beta_purchase
    if SITE_BETA == true
      @user.credits += 1
      @user.save
---
UPDATE `users` SET `updated_at` = '2010-10-25 22:46:35', `activated_at` = '2010-10-25 22:46:35' WHERE `id` = 1