app/controllers/job_posting_controller.rb

  def create
    @job = JobPosting.new(params[:jobPosting])
	@job.user_id = @user.id # does this need to happen?, yes i think so

	@job.start_run_date = Date.parse(@job.start_run_date.to_s) unless @job.start_run_date.nil?
	# otherwise the start_run_date gets set in the approved code

	#logger.debug
	if @job.zip.blank?
	  # we will have to change this for out-of-US jobs
	  @job.lat = -18.271835
	  @job.lng = 177.90255
	  @job.city = 'telecommute'
	else
	  geo = MultiGeocoder.geocode(@job.zip)
	  @job.lat = geo.lat
	  @job.lng = geo.lng
	  @job.city = geo.city
	end
	@job.save # there is no job.id until it is saved
---
SELECT * FROM `job_postings` WHERE (`job_postings`.user_id = 1)
INSERT INTO `job_postings` (`zip`, `updated_at`, `title`, `company_name`, `short_description`, `addl_instructions`, `lng`, `telecommute`, `company_type`, `job_type`, `long_description`, `owner_id`, `reference_id`, `pay`, `days_to_run`, `approved_at`, `lat`, `start_run_date`, `experience`, `created_at`) VALUES('92315', '2010-06-08 23:34:54', 'Seeking badass programmer', 'badass consulting', 'you have to be bad ass.', 'only bad ass people apply.', -116.899868, 0, 'Recruiter', 'full time bad assness', 'you have to be really bad ass.', 1, 'sasCoders1', '25K', 30, NULL, 34.2423893, '2011-04-20 07:00:00', '15 years being bad ass.', '2010-06-08 23:34:54')

  def edit
    @job = JobPosting.find(params[:id])
---
SELECT * FROM `job_postings` WHERE (`job_postings`.`id` = 1)

  def update
    # updates the job that came from the edit template
	job = JobPosting.new(params[:jobPosting]) # this gets the job with the updated parameters
	job.start_run_date = Date.parse(job.start_run_date.to_s) unless job.start_run_date.nil?
	job.user_id = @user.id # does this need to happen?, yes i think so
	# otherwise the start_run_date gets set in the approved code

	#logger.debug
	if job.zip.blank?
	  # we will have to change this for out-of-US jobs
	  job.lat = -18.271835
	  job.lng = 177.90255
	  job.city = 'telecommute'
	else
	  geo = MultiGeocoder.geocode(job.zip)
	  job.lat = geo.lat
	  job.lng = geo.lng
	  job.city = geo.city
	end
	currentJob = JobPosting.find(params[:id])
	currentJob.update_attributes(job.attributes)
---
SELECT * FROM `job_postings` WHERE (`job_postings`.user_id = 1)
SELECT * FROM `job_postings` WHERE (`job_postings`.`id` = 1)
UPDATE `job_postings` SET `updated_at` = '2010-11-08 23:52:47', `addl_instructions` = 'some addl instructions', `short_description` = 'Senior SAS/Credit Analyst' WHERE `id` = 4
UPDATE `users` SET `updated_at` = '2010-10-27 21:29:50', `activated_at` = '2010-10-27 21:29:50' WHERE `id` = 1

  def apply_credit
    @job = JobPosting.find(params[:id])
---
SELECT * FROM `job_postings` WHERE (`job_postings`.`id` = 1)

  def apply_credit_final
    @job = JobPosting.find(params[:id])
	quantity = params[:quantity].to_i
	redirect_to '/user/manage_ads' and return if quantity < 1
	# make sure the user has enough credits
	if @user.credits < quantity
	  flash[:notice] = "You do not have enough credits"
	  redirect_to '/user/manage_ads' and return
	  return
	end
	if @job.approved_at.blank?
	  flash[:notice] = "You can't apply credit to a job that hasn't been approved."
	  redirect_to '/user/manage_ads' and return
	  return
	end
	# should we check to make sure the job actually belongs to the user?
	# maybe in future

	# apply the credit
	@job.apply_credit!(quantity)
	flash[:notice] = "Successfully applied the credit"
	@user.credits -= quantity
	@user.save
---
SELECT * FROM `job_postings` WHERE (`job_postings`.`id` = 1)
UPDATE `users` SET `updated_at` = '2010-09-13 18:04:14', `activated_at` = '2010-09-13 18:04:14' WHERE `id` = 1