app/controllers/job_posting_controller.rb

  def delete
    # jobs are linked to users, do we need to take care of this?
    j = JobPosting.find(params[:id])
    j.delete
---
SELECT * FROM `job_postings` WHERE (`job_postings`.`id` = 1)
DELETE FROM `job_postings` WHERE (`id` IN (1))