app/controllers/search_controller.rb

SELECT * FROM `job_postings` WHERE (`job_postings`.`telecommute` = 1) LIMIT 1
SELECT * FROM `job_postings`
---
	   # do we need to add some telecommute jobs in?
	   if @telecommute == "include"
	     t = Array.new
	     t = JobPosting.find_all_by_telecommute(true)

		 t.delete_if {|job| job.end_date.blank? or (job.end_date < Time.now) }

SELECT * FROM `job_postings` WHERE (`job_postings`.`telecommute` = 1)
---
   def telecommute
     # this is for telecommute "only"
	 @jobs = JobPosting.find_all_by_telecommute(true, :order => "start_run_date DESC")

SELECT * FROM `job_postings` ORDER BY start_run_date DESC
---
   def get_all
     @jobs = JobPosting.find(:all, :order => "start_run_date DESC")
     @jobs.delete_if {|job| job.end_date.blank? or (job.end_date < Time.now) }

SELECT * FROM `job_postings` WHERE (`job_postings`.`state` = 'CA') LIMIT 1
---
   def by_state
     @jobs = Array.new
     state = params[:state]
     @geo = MultiGeocoder.geocode(state)
     @img = "http://maps.google.com/maps/api/staticmap?zoom=5&size=200x200&markers=color:blue|#{@geo.lat},#{@geo.lng}&sensor=false"
     @jobs = JobPosting.search_by_state(state)
     @jobs.delete_if {|job| job.end_date.blank? or (job.end_date < Time.now) }

SELECT * FROM `job_postings` WHERE (`job_postings`.`id` = 8)
SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
   def show
     @job = JobPosting.find(params[:id])
	 @geo = MultiGeocoder.geocode("#{@job.lat},#{@job.lng}")
	 @city = @geo.city

     # should this be something more like @job.user_id.company ?
	 u = User.find(@job.user_id)