app/controllers/user_controller.rb

  def index
    @user = User.find(session[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def edit
    @user = User.find(:session[:user_id])
    if @user.save
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `updated_at` = '2010-10-26 22:52:52', `activated_at` = '2010-10-26 22:52:52' WHERE `id` = 1