app/controllers/user_controller.rb

  def register
    # when a user registers, they are not officially logged in/etc until they validate
	# with their email

    @user = User.new
	@user.email = params[:email]
	@user.password = params[:password]
	@user.password_confirmation = params[:password_confirmation]
	@user.first_name = params[:first_name]
	@user.last_name = params[:last_name]
	@user.telephone = params[:telephone]
	@user.company = params[:company]
	@user.web_site = params[:web_site]
	@user.company_type = params[:company_type]
	@user.company_description = params[:company_description]


	if @user.save
---
SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`email`) = BINARY 'e@e.com' AND `users`.id <> 1) LIMIT 1
INSERT INTO `users` (`salt`, `company`, `activated_at`, `updated_at`, `hashed_password`, `activation_code`, `remember_token_expires_at`, `company_description`, `company_type`, `remember_token`, `web_site`, `display_name`, `first_name`, `telephone`, `credits`, `user_name`, `last_name`, `email`, `state`, `created_at`) VALUES('190223000.747566968586576', 'RAND', NULL, '2010-08-17 17:40:10', '6bc0ecf70161a960109aef56b9f0939595c1aa8c', 'a576cd8baa76202513eb672000a03db14f7eff48', NULL, 'The RAND corporation is a non-profit, research organization dedicated to providing un-biased policy solutions.', 'Primary', NULL, 'www.rand.org', NULL, 'or', '310 720 7859', 0, NULL, 'Hayden', 'orla_hayden@hotmail.com', NULL, '2010-08-17 17:40:10')

  def save
    # in future need to figure out how to check to make sure the update was applied successfully
=begin
	if @user.update_attributes(u.attributes)
---
UPDATE `users` SET `updated_at` = '2010-10-28 18:24:57', `activated_at` = NULL, `company_type` = NULL, `created_at` = NULL, `web_site` = 'www.sp.com', `activation_code` = NULL, `company` = 'pelican programming', `last_name` = 'philp', `first_name` = 'stephen', `company_description` = 'UnitedHealth Group is among the most ambitious Fortune 25 companies you\'ll ever meet. Through our family of businesses, we\'re working to make the health care system performs better for more people, in more ways than ever.\r\n\r\nSimply put, we think the entire system can be greater than it\'s ever been. And that drives us to work harder, aim higher, and expect more from one another.\r\n\r\nHere, you\'ll be empowered to make an immediate impact for millions of others. And you\'ll achieve more than you ever expected. How does that fit with your plans?\r\n\r\nUnitedHealth Group is an innovative leader in the health and well-being industry, serving more than 55 million Americans. Through our family of companies, we contribute outstanding clinical insight with consumer-friendly services and advanced technology to help people achieve optimal health.\r\n\r\nWhat makes your Healthcare Economics career greater with UnitedHealth Group? Advancement, access to data, variety of product lines, and rewards for delivering on our mission.' WHERE `id` = 2

  def login
    @user = User.authenticate(params[:email],params[:pw])
	if @user
    @user.activated_at = Time.now
	  @user.save
	  session[:user_id] = @user.id
	  flash[:notice] = "Hello #{@user.first_name}. You are now logged in."
---
UPDATE `users` SET `updated_at` = '2010-08-23 22:13:19', `activated_at` = '2010-08-23 22:13:19' WHERE `id` = 1
SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`email`) = BINARY 'admin@admin.com' AND `users`.id <> 1) LIMIT 1